GrzegorzewskiSzymon/STM32_TFT_RF/Inc/Libraries/RegistersConfig/RegistersConfig.c
/*
 * RegistersConfig.c
 *
 *  Created on: Dec 28, 2022
 *      Author: Szymon Grzegorzewski
 */

#include <stdint.h>
#include "stm32g431xx.h"
#include "RegistersConfig.h"

//
// GPIOx
//

void GPIOA_Setup()
{
	RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;


	//
	// PowerManagement
	//

	// PA0 connected to battery voltage divider output
	// PA0 - ADC12_IN1
//	GPIOA->MODER &= ~ (GPIO_MODER_MODE0_0 | GPIO_MODER_MODE0_1 ); // Input

	// PA15 connected to gate of mosfet
	GPIOA->MODER &= ~ GPIO_MODER_MODE15_1; // GPOM

}


void GPIOC_Setup()
{
	RCC->AHB2ENR |= RCC_AHB2ENR_GPIOCEN;


	//
	// SPI 3 - NRF24L01
	//

	// PC0 as CS
	GPIOC->MODER &= ~ GPIO_MODER_MODE0_1; // GPOM

	// PC10 as SCK
	GPIOC->MODER &= ~ GPIO_MODER_MODE10_0; // Alternate function mode
	GPIOC->AFR[1] |= (6<<GPIO_AFRH_AFSEL10_Pos); //AF6

	// PC11 as MISO
	GPIOC->MODER &= ~ GPIO_MODER_MODE11_0; // Alternate function mode
	GPIOC->AFR[1] |= (6<<GPIO_AFRH_AFSEL11_Pos); //AF6

	// PC12 as MOSI
	GPIOC->MODER &= ~ GPIO_MODER_MODE12_0; // Alternate function mode
	GPIOC->AFR[1] |= (6<<GPIO_AFRH_AFSEL12_Pos); //AF6

	// PC3 as IRQ
	GPIOC->MODER &= ~ (GPIO_MODER_MODE3_0 |GPIO_MODER_MODE3_1 ); // Input

	//PC2 as Chip Enable (CE)
	GPIOC->MODER  &= ~GPIO_MODER_MODE2_1;// Output
}

//
// SysClk
//

void ClockFrequency_Setup()
{

	RCC->CR |= (1<<8); //HSION

	while(!(RCC->CR & (1<<10))); //HSIRDY

	RCC->CR = 0x00000063;//reset

	//Enable HSE and wait till its ready
	RCC->CR |= (1<<16); //HSEON
	while (!(RCC->CR & (1<<17)));//HSERDY


	//Select the Range 1 boost mode by clearing the R1MODE bit is in the PWR_CR5 register
	PWR->CR5 &= ~(1<<8);

	//Voltage scaling range selection
	PWR->CR1 |= (1<<9);//VOS[0;1] -> Range 1


	FLASH->ACR |= (1<<8);//Enable prefetch to mitigate the disparity in speed at higher clock rates
	FLASH->ACR |= (5<<0);//Period to the Flash access time


	                        //PLLR = 2 by default
	RCC->PLLCFGR |= (85<<8);//PLLN = 85
	RCC->PLLCFGR |= (5<<4); //PLLM = 6
	RCC->PLLCFGR |= (3<<0); //PLL SRC
	RCC->PLLCFGR |= (1<<24);//Main PLL clock selected

	//Enable the PLL again by setting PLLON
	RCC->CR |= (1<<24);

	//Wait until PLLRDY is set
	while(!(RCC->CR & 1<<25))
	{
	}

	//The system clock must be divided by 2 using the AHB prescaler before switching
	// to a higher system frequency
	RCC->CFGR |= (1<<7);

	// Configure and switch to PLL for a new system frequency
	RCC->CFGR |= (3<<0);

	//Wait for at least 1us and then reconfigure the AHB prescaler to get the needed
	// HCLK clock frequency.
	while(!(RCC->CFGR & (2<<2)) && !(RCC->CFGR & (1<<2)))
	{
	}

	RCC->CFGR &= ~(1<<7);
}


//
// Battery Management
//

void ADC1_RegistersCalib()
{
	ADC1->CR &= ~ADC_CR_ADCALDIF;
	ADC1->CR |=  ADC_CR_ADCAL; //Start the calibration of the ADC
	while(ADC1->CR & ADC_CR_ADCAL) //Wait for the end of the calibration
	{

	}
}

void ADC1_Setup()
{
	//Clock signal
	RCC->AHB2ENR |= RCC_AHB2ENR_ADC12EN;

	ADC12_COMMON->CCR |= (3<<ADC_CCR_CKMODE_Pos); //Adc_hclk/4

	ADC1->CR = 0; //Disable deep power_down mode
	ADC1->CR |= ADC_CR_ADVREGEN; //Voltage regulator enable

	ADC1->SMPR1 |= (4<<ADC_SMPR1_SMP1_Pos);	//47.5 ADC clock cycles

	ADC1_RegistersCalib();

	ADC1->ISR |= ADC_ISR_ADRDY; //Clear the ADRDY bit
	ADC1->CR |= ADC_CR_ADEN;   //Enable the ADC

	while (!(ADC1->ISR & ADC_ISR_ADRDY)) //Wait for ADC to be ready to start conversion
	{
	}

	ADC1->IER |= ADC_IER_EOCIE; //End of regular conversion interrupt enable
//	ADC1->CFGR |= (3<<ADC_CFGR_EXTEN_Pos); //Trigger detection on both the rising and falling edges
//	ADC1->CFGR |= (4<<ADC_CFGR_EXTSEL_Pos); //TIM3_TRGO

	NVIC_EnableIRQ(ADC1_2_IRQn);

}



void ADC1_StartConversion()
{

	ADC1->SQR1 |= (1<<ADC_SQR1_SQ1_Pos); //Channel number assigned as the 1st in the regular conversion sequence
	ADC1->CR |= ADC_CR_ADSTART; //Start of regular conversion
//	while(!((ADC1->ISR)&ADC_ISR_EOC))// Waiting for end of the conversions
//	{
//	}
//	return ADC1->DR;
}

//
// Systick
//

void Systick_Setup()
{
	NVIC_EnableIRQ(SysTick_IRQn); //Enable interrupt from Systick

	SysTick->LOAD = (uint32_t)170000;              //The value which will be decrementing, 24bit value
	SysTick->VAL = 0;                              //(undefined on reset)
 	SysTick->CTRL  =  (SysTick_CTRL_CLKSOURCE_Msk) //Processor clock (AHB)
 				   |  (SysTick_CTRL_ENABLE_Msk)    //Enables the counter
 				   |  (SysTick_CTRL_TICKINT_Msk);  //Exception request
}

//
// SPI 3 - NRF24L01
//

void Spi3_Setup()
{
	RCC->APB1ENR1 |= RCC_APB1ENR1_SPI3EN;
										//MSB first (by default)
										//Clock polarity to 0 when idle (by default)
										//The first clock transition is the first data capture edge (by default)
										//Data size 8-bit (by default)
										//Motorola frame format (by default)
										//No NSS pulse (by default)
	SPI3->CR1 |= SPI_CR1_MSTR;			//Master configuration
	SPI3->CR1 |= (4<<SPI_CR1_BR_Pos);	//fPCLK/32 = 5,3125Mhz
	SPI3->CR1 |= (1<<8) | (1<<9);  		//Software Slave Management
	SPI3->CR2 = 0;
	SPI3->CR2 |= SPI_CR2_FRXTH;//RXNE event is generated if the FIFO level is greater than or equal to 1/4 (8-bit)
}

void Spi3_Send(uint8_t *byte, uint32_t length)
{

	SPI_NRF24L01_ENABLE;
    while (length > 0U)
    {
    	//not sure if necessary
    	if (((SPI3->SR)&(1<<1)))//Wait for TXE bit to set -> This will indicate that the buffer is empty
    	{
    		*((volatile uint8_t *) &SPI3->DR) = (*byte);//Load the data into the Data Register
    		byte++;
    		length--;
    	}
    }
    //not sure if necessary
	//Wait for BSY bit to Reset -> This will indicate that SPI is not busy in communication
	while (((SPI3->SR)&(1<<7))) {};
    SPI_NRF24L01_DISABLE;
}

uint8_t Spi3_Read8()
{
	SPI_NRF24L01_ENABLE;
    while(!(SPI3->SR & SPI_SR_TXE));
    *(volatile uint8_t *)&SPI3->DR = 0;
    while (!(SPI3->SR & SPI_SR_RXNE));
    return *(volatile uint8_t *)&SPI3->DR;
    SPI_NRF24L01_DISABLE;
}

void Spi3_Read8_Multi(uint8_t *dataRx, uint16_t cnt)
{
	SPI_NRF24L01_ENABLE;
	for(uint8_t i= 0; i < cnt; i++)
	{
    while(!(SPI3->SR & SPI_SR_TXE));//Wait while buffer not empty
    *(volatile uint8_t *)&SPI3->DR = 0;
    while (!(SPI3->SR & SPI_SR_RXNE));
    dataRx[i] = *(volatile uint8_t *)&SPI3->DR;
	}
	SPI_NRF24L01_DISABLE;
}

void Spi3_ClearRxBuff()
{
	SPI_NRF24L01_ENABLE;
	while(SPI3->SR & SPI_SR_RXNE) //while receive buffer not empty
	{
		*(volatile uint8_t *)&SPI3->DR; //read data
	}
	SPI_NRF24L01_DISABLE;
}

void TIM3_Setup()
{
	RCC->APB1ENR1 |= RCC_APB1ENR1_TIM3EN; //TIM3 clock enable

	/*Set channel 1 to active level on match. tim_oc1ref signal is forced high when the
	 *	counter TIMx_CNT matches the capture/compare register 1 (TIMx_CCR1).
	 * */
	TIM3->CCMR1 |= (1<<TIM_CCMR1_OC1M_Pos);

	/*Frq = [CLK/(PSC+1)]/[ARR]
	 * 1Hz
	 * */
	TIM3->PSC = 16999;
	TIM3->CNT =  0;
	TIM3->ARR =  9999;
//	TIM3->CCR1 = 9999;

	//Master mode selection
	TIM3->CR2  |= (4<<4); //Compare - tim_oc1refc signal is used as trigger output (tim_trgo)
	TIM3->DIER |=  TIM_DIER_UIE;//Update interrupt enable
	TIM3->EGR  |= TIM_EGR_UG; 	//Update generation

	NVIC_EnableIRQ(TIM3_IRQn);    //Enable interrupt from TIM3

	TIM3->CR1 |= (1<<0);//Counter enabled
}


//
// INTERRUPT HANDLERS
//

//Battery 1HZ
void TIM3_IRQHandler()
{
	ADC1_StartConversion();
	TIM3->CNT =  0;
	TIM3->SR = 0;//Reset flag
}

uint16_t battRawVoltageData;
void ADC1_2_IRQHandler()
{
	battRawVoltageData = ADC1->DR;
	ADC1->ISR |= ADC_ISR_EOC; //Reset flag
}


//SYSTICK
uint64_t ms;
void SysTick_Handler()
{
	ms++;
}
